dewayne57/PIC18F__Q43/03 I2C/I2C 01 Bit Bang Master/app.c
/* *****************************************************************************************
 *   File Name: app.c
 *   Description: Bit bang I2C master implementation for PIC18F47Q43.
 *   Author: Dewayne Hafenstein
 *   Date: 2026-05-11
 *
 *   Copyright (c) 2026, Dewayne Hafenstein.
 *   Licensed under the Apache License, Version 2.0 (the "License");
 *   you may not use this file except in compliance with the License.
 *   You may obtain a copy of the License at
 *
 *       http://www.apache.org/licenses/LICENSE-2.0
 *
 *   Unless required by applicable law or agreed to in writing, software
 *   distributed under the License is distributed on an "AS IS" BASIS,
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *   See the License for the specific language governing permissions and
 *   limitations under the License.
 *
 *   This is the demonstration application implementation for the I2C 01 Bit Bang Master
 *   example. It initializes the system, sets up UART1 for debug output, and configures
 *   the I2C bit bang master interface.
 *
 *   This application uses an MCP23017 I2C I/O expander as a remote slave device for
 *   demonstration purposes. Port A is configured as digital inputs with weak pull-ups
 *   enabled and interrupt on change enabled.  Port A is connected to an 8-switch DIP
 *   switch to ground.  When a switch is closed, the pin is driven low.  On this switch
 *   this is denoted as "on" so we must interpret a low input as "on".
 *
 *   Port A and Port B interrupts are not strapped or pinned  together to allow for
 *   separate interrupt handling.  Port B interrupts are not used in this example.
 *
 *   Port B is configured as digital outputs and is connected to 8 LEDs.  The state of the
 *   LEDs is updated to match the outputs and drives 8 LEDs for visual feedback.
 ***************************************************************************************** */

#include <xc.h>
#include <stdio.h>
#include "config.h"
#include "app.h"
#include "i2c.h"
#include "mcp23x17.h"
#include "../../Libraries/UARTLIB/uartlib.h"

extern uart_handle_t console_uart;
extern i2c_handle_t i2c_master;
extern uint8_t i2c_buffer[16];

static void diag_led_set(uint8_t code)
{
    LATDbits.LATD0 = (code & 0x01U) ? 0U : 1U;
    LATDbits.LATD1 = (code & 0x02U) ? 0U : 1U;
    LATDbits.LATD2 = (code & 0x04U) ? 0U : 1U;
    LATDbits.LATD3 = (code & 0x08U) ? 0U : 1U;
}

static void diag_show_address_index(uint8_t address_index)
{
    diag_led_set((uint8_t)(0x08U | (address_index & 0x07U)));
}

static void diag_scan_mcp23017_addresses(i2c_handle_t *handle)
{
    for (uint8_t address_index = 0; address_index < 8U; address_index++)
    {
        uint8_t probe_address = (uint8_t)(0x40U | (address_index << 1));
        if (I2C_ProbeAddress(handle, probe_address) == I2C_SUCCESS)
        {
            diag_show_address_index(address_index);
            return;
        }
    }
}

/// @brief ISR for UART1 Transmit, UART1 Receive, and External IOC on RB2
/// @param  None
/// @return None
void __interrupt(irq(0x07), low_priority) ISR(void)
{
    // Handle UART1 Receive Interrupt
    if ((PIE4bits.U1RXIE != 0U) && (PIR4bits.U1RXIF != 0U))
    {
        UART_HandleRxInterrupt(&console_uart);
    }

    // Handle UART1 Transmit Interrupt
    if ((PIE4bits.U1TXIE != 0U) && (PIR4bits.U1TXIF != 0U))
    {
        UART_HandleTxInterrupt(&console_uart);
    }
}

/// @brief Handle external interrupt on RB2 to read MCP23017 port A and copy to MCP23017 port B
/// @param  None
/// @return None
/// @note This function reads the MCP23017 port A register and writes the value to MCP23017
///       port B
void __interrupt(irq(0x08), low_priority) Extern_ISR(void)
{
    uint8_t mcp_port_a_value = 0x00;
    uint8_t reg_addr = BANKED_GPIOA;

    // Select GPIOA register, then read one byte from the slave.
    i2c_status_t status = I2C_SendBytes(&i2c_master, MCP23017_ADDR, &reg_addr, 1);
    if (status == I2C_SUCCESS)
    {
        status = I2C_ReceiveByte(&i2c_master, MCP23017_ADDR, &mcp_port_a_value, false);
    }

    if (status == I2C_SUCCESS)
    {
        // Write MCP23017 Port A value to MCP23017 Port B OLAT register.
        uint8_t write_buf[2] = {BANKED_OLATB, mcp_port_a_value};
        status = I2C_SendBytes(&i2c_master, MCP23017_ADDR, write_buf, 2);
    }

    // Clear the interrupt flag
    PIR0bits.IOCIF = 0;
}

/// @brief Initialize the MCP23017 I/O expander.
/// The MCP23017 is configured in banked addressing mode so Port A registers are
/// contiguous within one block and Port B registers are contiguous within another.
/// @param handle Pointer to i2c_handle_t structure
/// @return i2c_status_t indicating success or error
static i2c_status_t MCP23017_Initialize(i2c_handle_t *handle)
{
    i2c_status_t status;

    // Enter banked mode (BANK=1) while keeping address auto-increment enabled (SEQOP=0).
    // ODR=0 keeps INT in push-pull output mode.
    i2c_buffer[0] = IOCON;
    i2c_buffer[1] = 0x80;
    status = I2C_SendBytes(handle, MCP23017_ADDR, i2c_buffer, 2);
    if (status != I2C_SUCCESS)
    {
        return status;
    }

    // Configure Port A in one contiguous banked transfer.
    i2c_buffer[0] = BANKED_IODIRA;
        i2c_buffer[1] = 0xFF; // IODIRA: inputs
        i2c_buffer[2] = 0x00; // IPOLA
        i2c_buffer[3] = 0xFF; // GPINTENA
        i2c_buffer[4] = 0x00; // DEFVALA
        i2c_buffer[5] = 0x00; // INTCONA
        i2c_buffer[6] = 0x80; // IOCON
        i2c_buffer[7] = 0xFF; // GPPUA
        i2c_buffer[8] = 0x00; // INTFA (write ignored)
        i2c_buffer[9] = 0x00; // INTCAPA (write ignored)
        i2c_buffer[10] = 0x00; // GPIOA
    status = I2C_SendBytes(handle, MCP23017_ADDR, i2c_buffer, 11);
    if (status != I2C_SUCCESS)
    {
        return status;
    }

    // Configure Port B in one contiguous banked transfer.
    i2c_buffer[0] = BANKED_IODIRB;
        i2c_buffer[1] = 0x00; // IODIRB: outputs
        i2c_buffer[2] = 0x00; // IPOLB
        i2c_buffer[3] = 0x00; // GPINTENB
        i2c_buffer[4] = 0x00; // DEFVALB
        i2c_buffer[5] = 0x00; // INTCONB
        i2c_buffer[6] = 0x80; // IOCON
        i2c_buffer[7] = 0x00; // GPPUB
        i2c_buffer[8] = 0x00; // INTFB (write ignored)
        i2c_buffer[9] = 0x00; // INTCAPB (write ignored)
        i2c_buffer[10] = 0x00; // GPIOB
        status = I2C_SendBytes(handle, MCP23017_ADDR, i2c_buffer, 11);
    if (status != I2C_SUCCESS)
    {
        return status;
    }

    return status;
}

/// @brief Initialize the application.
/// @param  None
/// @return None
/// @note This function initializes the system, UART1 for debug output, and I2C
///       bit bang master interface. It also prints status messages to the console.
void APP_Initialize(void)
{
    printf("I2C 01 Bit Bang Master\r\n");
    diag_led_set(0x01U);

    /*
     * Configure RB2 as an IOC input. We use this interrupt to detect
     * changes signaled by the MCP23017 INT pin.
     */
    TRISBbits.TRISB2 = 1;   // RB2 is input
    ANSELBbits.ANSELB2 = 0; // RB2 is digital
    WPUBbits.WPUB2 = 1;     // Weak pull-up enabled on RB2

    // Configure IOC interrupt for falling edge on RB2.
    IOCBPbits.IOCBP2 = 0;
    IOCBNbits.IOCBN2 = 1;
    IOCBFbits.IOCBF2 = 0;
    PIE0bits.IOCIE = 0;
    PIR0bits.IOCIF = 0;

    // Initialize I2C bit bang master for 100kHz bus speed
    if (I2C_Initialize(&i2c_master, 100) != I2C_SUCCESS)
    {
        printf("Error: Failed to initialize I2C\r\n");
        while (1)
        {
            // Halt here if I2C initialization fails
        }
    }

    printf("Initializing MCP23017 I/O expander\r\n");
    diag_led_set(0x03U);
    if (MCP23017_Initialize(&i2c_master) != I2C_SUCCESS)
    {
        diag_scan_mcp23017_addresses(&i2c_master);
        printf("Error: Failed to initialize MCP23017\r\n");
        while (1)
        {
            // Halt here if MCP23017 initialization fails
        }
    }

    PIR0bits.IOCIF = 0;
    PIE0bits.IOCIE = 1;

    diag_led_set(0x0FU);
    printf("I2C initialized successfully\r\n");
}

